[{"title": "Life3.0 is new book relased.", "content": "The Omega Team was the soul of the company. Whereas the rest of the\r\nenterprise brought in the money to keep things going, by various commercial\r\napplications of narrow AI, the Omega Team pushed ahead in their quest for what\r\nhad always been the CEO’s dream: building general artificial intelligence. Most\r\nother employees viewfed “the Omegas,” as they affedfgdgdgctionately called them, as a\r\nbunch of pie-in-the-sky dreamers, perpetually decades away from their goal.\r\nThey happily indulged them, however, because they liked the prestige that the\r\ncutting-edge work of the Omegas gave their company, and they also appreciated\r\nthe improved algorithms that the Omegas occasionally gave them.\r\nWhat they didn’t realize was that the Omegas had carefully crafted their\r\nimage to hide a secret: they were extremely close to pulling off the most\r\naudacious plan in human history. Their charismatic CEO had handpicked them\r\nnot only for being brilliant researchers, but also for ambition, idealism and a\r\nstrong commitment to helping humanity. He reminded them that their plan was\r\nextremely dangerous, and that if powerful governments found out, they would\r\ndo virtually anything—including kidnapping—to shut them down or, preferably,\r\nto steal their code. But they were all in, 100%, for much the same reason that\r\nmany of the world’s top physicists joined the Manhattan Project to develop\r\nnuclear weapons: they were convinced that if they didn’t do it first, someone less\r\nidealistic would.\r\nThe AI they had built, nicknamed Prometheus, kept getting more capable.\r\nAlthough its cognitive abilities still lagged far behind those of humans in many\r\nareas, for example, social skills, the Omegas had pushed hard to make itextraordinary at one particular task: programming AI systems. They’d\r\ndeliberately chosen this strategy because they had bought the intelligence\r\nexplosion argument made by the British mathematician Irving Good back in\r\n1965: “Let an ultraintelligent machine be defined as a machine that can far\r\nsurpass all the intellectual activities of any man however clever. Since the design\r\nof machines is one of these intellectual activities, an ultraintelligent machine\r\ncould design even better machines; there would then unquestionably be an\r\n‘intelligence explosion,’ and the intelligence of man would be left far behind.\r\nThus the first ultraintelligent machine is the last invention that man need ever\r\nmake, provided that the machine is docile enough to tell us how to keep it under\r\ncontrol.”\r\nThey figured that if they could get this recursive self-improvement going, the machine would soon get smart enough that it could also teach itself all other\r\nhuman skills that would be useful.The First Millions\r\nIt was nine o’clock on a Friday morning when they decided to launch.\r\nPrometheus was humming away in its custom-built computer cluster, which\r\nresided in long rows of racks in a vast, access-controlled, air-conditioned room.\r\nFor security reasons, it was completely disconnected from the internet, but it\r\ncontained a local copy of much of the web (Wikipedia, the Library of Congress,\r\nTwitter, a selection from YouTube, much of Facebook, etc.) to use as its training\r\ndata to learn from.* They’d picked this start time to work undisturbed: their\r\nfamilies and friends thought they were on a weekend corporate retreat. The\r\nkitchenette was loaded with microwaveable food and energy drinks, and they\r\nwere ready to roll.", "image_urls": ["/static/uploads/Physical_Drivers_of_climate_change.svg.png"], "date": "2024-08-16", "id": 1, "likes": 3}, {"title": "Causability and explainability of artificial intelligence in medicine", "content": "Explainable artificial intelligence (AI) is attracting much interest in medicine. Technically, the problem of explainability is as old as AI itself and classic AI represented comprehensible retraceable approaches. However, their weakness was in dealing with uncertainties of the real world. Through the introduction of probabilistic learning, applications became increasingly successful, but increasingly opaque. Explainable AI deals with the implementation of transparency and traceability of statistical black-box machine learning methods, particularly deep learning (DL). We argue that there is a need to go beyond explainable AI. To reach a level of explainable medicine we need causability. In the same way that usability encompasses measurements for the quality of use, causability encompasses measurements for the quality of explanations. In this article, we provide some necessary definitions to discriminate between explainability and causability as well as a use-case of DL interpretation and of human explanation in histopathology. The main contribution of this article is the notion of causability, which is differentiated from explainability in that causability is a property of a person, while explainability is a property of a system", "image_urls": ["/static/uploads/481_2023_761_Fig1_HTML.png", "/static/uploads/Untitled.png"], "date": "2024-02-01T09:30", "id": 2, "likes": 1}, {"title": "dsfsdf", "content": "sdfsdfsdfsfsfsfsdf", "image_urls": ["/static/uploads/Untitled_copy.png", "/static/uploads/Untitled.png"], "date": "2024-07-24T09:30", "id": 3, "likes": 2}, {"title": "Bridges to Meditation", "content": "Atman is a central topic in all of the Upanishads, and \"know your Ātman\" is one of their thematic foci.[23] The Upanishads say that Atman denotes \"the ultimate essence of the universe\" as well as \"the vital breath in human beings\", which is \"imperishable Divine within\" that is neither born nor does it die.[24] Cosmology and psychology are indistinguishable, and these texts state that the core of every person's Self is not the body, nor the mind, nor the ego, but Ātman. The Upanishads express two distinct, somewhat divergent themes on the relation between Atman and Brahman. Some teach that Brahman (highest reality; universal principle; being-consciousness-bliss) is identical with Ātman, while others teach that Ātman is part of Brahman but not identical to it.[25][26] This ancient debate flowered into various dual and non-dual theories in Hinduism. The Brahmasutra by Badarayana (~100 BCE) synthesized and unified these somewhat conflicting theories, stating that Atman and Brahman are different in some respects, particularly during the state of ignorance, but at the deepest level and in the state of self-realization, Atman and Brahman are identical, non-different (advaita).[25] According to Koller, this synthesis countered the dualistic tradition of Samkhya-Yoga schools and realism-driven traditions of Nyaya-Vaiseshika schools, enabling it to become the foundation of Vedanta as Hinduism's most influential spiritual tradition.[25]", "image_urls": ["/static/uploads/1699985608504.jpeg", "/static/uploads/bhagwan-shri-rajneesh-on-a-chair-1024x576.webp", "/static/uploads/Untitled11.jpeg"], "date": "2024-07-31T09:45", "id": 4, "likes": 1}, {"title": "Understanding the difference between Causal ML, Explainable AI and their intersection.", "content": "As ML models become more complex, it becomes increasingly difficult to understand how they make predictions. Two emerging fields, causal ML and explainable AI, aim to address this challenge.\r\n\r\nCausal ML focuses on inferring cause-and-effect relationships from observational or experimental data. It seeks to estimate the effect of a specific variable, known as the treatment, on an outcome of interest, while controlling for other confounding factors that could bias the estimate. Causal inference is a crucial tool for decision-making in fields such as healthcare, economics, and policy, where we need to identify the most effective interventions and avoid unintended consequences.\r\n\r\nExplainable AI, on the other hand, aims to make ML models more transparent and interpretable. It provides insights into how a model makes predictions, what features are most important, and how sensitive the model is to changes in the input. Explainable AI techniques include feature attribution, which quantifies the contribution of each input variable to the output, and model visualization, which generates intuitive representations of the model's decision process. These techniques can help users understand how the model works, detect potential biases or errors, and improve the model's performance.\r\n\r\nCausal ML and explainable AI are complementary approaches that can benefit from each other. Causal inference can inform the design of more interpretable models by identifying the key features and relationships that drive the outcome of interest. Conversely, explainable AI can validate causal assumptions and detect potential confounders that could undermine causal inference. For example, a model that predicts the effect of a new drug on a disease outcome could use causal inference to estimate the causal effect, and then use explainable AI to show how the prediction depends on the patient's demographics, disease severity, and other factors.\r\n\r\nIn conclusion, causal ML and explainable AI are two emerging fields that can help us understand and improve the performance of ML models. Causal inference provides a rigorous framework for identifying cause-and-effect relationships from data, while explainable AI provides tools for visualizing and interpreting the model's decision process. By combining these approaches, we can build models that are not only accurate but also transparent and interpretable, enabling us to make better decisions in a wide range of applications.", "image_urls": ["/static/uploads/Screenshot_from_2024-07-27_01-22-00.png", "/static/uploads/Screenshot_from_2024-07-27_01-22-23.png"], "date": "2024-07-27T10:30", "id": 5, "likes": 1}, {"title": "Cyclying in Leeds", "content": "The purpose of this study was to update the evidence on the health benefits of cycling. A systematic review of the literature resulted in 16 cycling-specific studies. Cross-sectional and longitudinal studies showed a clear positive relationship between cycling and cardiorespiratory fitness in youths. Prospective observational studies demonstrated a strong inverse relationship between commuter cycling and all-cause mortality, cancer mortality, and cancer morbidity among middle-aged to elderly subjects. Intervention studies among working-age adults indicated consistent improvements in cardiovascular fitness and some improvements in cardiovascular risk factors due to commuting cycling. Six studies showed a consistent positive dose–response gradient between the amount of cycling and the health benefits. Systematic assessment of the quality of the studies showed most of them to be of moderate to high quality. According to standard criteria used primarily for the assessment of clinical studies, the strength of this evidence was strong for fitness benefits, moderate for benefits in cardiovascular risk factors, and inconclusive for all-cause mortality, coronary heart disease morbidity and mortality, cancer risk, and overweight and obesity. While more intervention research is needed to build a solid knowledge base of the health benefits of cycling, the existing evidence reinforces the current efforts to promote cycling as an important contributor for better population health.", "image_urls": ["/static/uploads/hero005.jpg", "/static/uploads/cycling.jpg"], "date": "2024-07-28T04:30", "id": 6}, {"title": "ssaffsd", "content": "asdfsaffasfdf", "image_urls": ["/static/uploads/maxresdefault.jpg"], "date": "2024-08-03T04:05", "id": 7}, {"title": "Climate Change", "content": "In common usage, climate change describes global warming—the ongoing increase in global average temperature—and its effects on Earth's climate system. Climate change in a broader sense also includes previous long-term changes to Earth's climate. The current rise in global average temperature is primarily caused by humans burning fossil fuels since the Industrial Revolution.[3][4] Fossil fuel use, deforestation, and some agricultural and industrial practices add to greenhouse gases.[5] These gases absorb some of the heat that the Earth radiates after it warms from sunlight, warming the lower atmosphere. Carbon dioxide, the primary greenhouse gas driving global warming, has grown by about 50% and is at levels unseen for millions of years.[6]\r\n\r\nClimate change has an increasingly large impact on the environment. Deserts are expanding, while heat waves and wildfires are becoming more common.[7][8] Amplified warming in the Arctic has contributed to thawing permafrost, retreat of glaciers and sea ice decline.[9] Higher temperatures are also causing more intense storms, droughts, and other weather extremes.[10] Rapid environmental change in mountains, coral reefs, and the Arctic is forcing many species to relocate or become extinct.[11] Even if efforts to minimise future warming are successful, some effects will continue for centuries. These include ocean heating, ocean acidification and sea level rise.[12]\r\n\r\nClimate change threatens people with increased flooding, extreme heat, increased food and water scarcity, more disease, and economic loss. Human migration and conflict can also be a result.[13] The World Health Organization (WHO) calls climate change one of the biggest threats to global health in the 21st century.[14] Societies and ecosystems will experience more severe risks without action to limit warming.[15] Adapting to climate change through efforts like flood control measures or drought-resistant crops partially reduces climate change risks, although some limits to adaptation have already been reached.[16][17] Poorer communities are responsible for a small share of global emissions, yet have the least ability to adapt and are most vulnerable to climate change.[18][19]\r\nBobcat Fire in Monrovia, CA, September 10, 2020\r\nBleached colony of Acropora coral\r\nA dry lakebed in California, which is experiencing its worst megadrought in 1,200 years.[20]\r\nExamples of some effects of climate change: Wildfire intensified by heat and drought, bleaching of corals occurring more often due to marine heatwaves, and worsening droughts compromising water supplies.\r\n\r\nMany climate change impacts have been felt in recent years, with 2023 the warmest on record at +1.48 °C (2.66 °F) since regular tracking began in 1850.[21][22] Additional warming will increase these impacts and can trigger tipping points, such as melting all of the Greenland ice sheet.[23] Under the 2015 Paris Agreement, nations collectively agreed to keep warming \"well under 2 °C\". However, with pledges made under the Agreement, global warming would still reach about 2.7 °C (4.9 °F) by the end of the century.[24] Limiting warming to 1.5 °C would require halving emissions by 2030 and achieving net-zero emissions by 2050.[25][26][27][28]\r\n\r\nFossil fuel use can be phased out by conserving energy and switching to energy sources that do not produce significant carbon pollution. These energy sources include wind, solar, hydro, and nuclear power.[29][30] Cleanly generated electricity can replace fossil fuels for powering transportation, heating buildings, and running industrial processes.[31] Carbon can also be removed from the atmosphere, for instance by increasing forest cover and farming with methods that capture carbon in soil.[32][33] ", "image_urls": ["/static/uploads/Bobcat_Fire_Los_Angeles_San_Gabriel_Mountains.jpg", "/static/uploads/1955-_Ocean_heat_content_-_NOAA.svg.png", "/static/uploads/Physical_Drivers_of_climate_change.svg.png"], "date": "2024-08-04T05:30", "id": 8}, {"title": "wwerwerwerwer", "content": "werewrewrewrewrwerwere", "image_urls": [], "date": "2024-08-07T05:05", "id": 9}, {"title": "werwerewrwerwerwer", "content": "werwerwerwerwrwrwrw", "image_urls": [], "date": "2024-08-17T06:05", "id": 10}, {"title": "ssdfsf", "content": "sfsfsdsdsfs", "image_urls": [], "date": "2024-08-23T03:04", "id": 11, "likes": 0}]